{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "nb_col": 3, "bias": true, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_1", "W_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 32, "W_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "b_constraint": null, "border_mode": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_2", "W_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 32, "W_regularizer": null, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_3", "W_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "border_mode": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_4", "W_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_5", "W_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 128, "W_regularizer": null, "b_constraint": null, "border_mode": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_6", "W_constraint": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "nb_filter": 128, "W_regularizer": null, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 512, "b_constraint": null, "name": "dense_1", "W_constraint": null, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 256, "b_constraint": null, "name": "dense_2", "W_constraint": null, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 128, "b_constraint": null, "name": "dense_3", "W_constraint": null, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 64, "b_constraint": null, "name": "dense_4", "W_constraint": null, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 32, "b_constraint": null, "name": "dense_5", "W_constraint": null, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 10, "b_constraint": null, "name": "dense_6", "W_constraint": null, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_12"}}]}